app/controllers/users_controller.rb

	def create
		User.create(user_params)
---
INSERT INTO "users" ("name", "age", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "bbbb"], ["age", 45], ["created_at", "2019-02-06 09:52:08.491740"], ["updated_at", "2019-02-06 09:52:08.491740"]]

	def destroy
		user = User.find(params[:id])
		user.delete
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 4]]

	def update
		user = User.find(params[:id])
		user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "age" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "rrrrrrrkkkkkeeeee"], ["age", 44], ["updated_at", "2019-02-07 20:53:41.881844"], ["id", 3]]